In [1]:
import pandas as pd
import numpy as np

In [2]:
people = {
    'first':['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'],
    'last':['Schafer', 'Doe', 'Doe','Schafer', np.nan, np.nan, 'Missing'],
    'email':['CoreyMschafer@gmail.com', 'JaneDoe@gmail.com', 'JohnDoe@gmail.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age':['33', '55', '63', '36', None, None, 'Missing'],
}

In [3]:
df =pd.DataFrame(people)

#To replace NA and Missing use replace method
df.replace('NA', np.nan, inplace=True)
df.replace('Missing', np.nan, inplace=True)

df

   first     last                    email   age
0  Corey  Schafer  CoreyMschafer@gmail.com    33
1   Jane      Doe        JaneDoe@gmail.com    55
2   John      Doe        JohnDoe@gmail.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

In [4]:
# dropna() is used to drop the rows or columns with missing values
#By default the dropna has axis='index'(Rows are to be checked for missing values) if axis='columns'(Columns will be checked)
#and how='any' that refer to on what basis rows or columns will be removed

df.dropna()

   first     last                    email age
0  Corey  Schafer  CoreyMschafer@gmail.com  33
1   Jane      Doe        JaneDoe@gmail.com  55
2   John      Doe        JohnDoe@gmail.com  63

In [5]:
#if how='all' only those row or column that have all null values will be removed

df.dropna(how='all')

   first     last                    email   age
0  Corey  Schafer  CoreyMschafer@gmail.com    33
1   Jane      Doe        JaneDoe@gmail.com    55
2   John      Doe        JohnDoe@gmail.com    63
3  Chris  Schafer                     None    36
5   None      NaN      Anonymous@email.com  None

In [6]:
#subset attribute can be used to search in for null values in specific columns

df.dropna(subset=['email'])

   first     last                    email   age
0  Corey  Schafer  CoreyMschafer@gmail.com    33
1   Jane      Doe        JaneDoe@gmail.com    55
2   John      Doe        JohnDoe@gmail.com    63
5   None      NaN      Anonymous@email.com  None

In [7]:
#We can see the difference how 'any' and 'all' value works

df.dropna(how='any', subset=['last', 'email'])

   first     last                    email age
0  Corey  Schafer  CoreyMschafer@gmail.com  33
1   Jane      Doe        JaneDoe@gmail.com  55
2   John      Doe        JohnDoe@gmail.com  63

In [8]:
df.dropna(how='all', subset=['last', 'email'])

   first     last                    email   age
0  Corey  Schafer  CoreyMschafer@gmail.com    33
1   Jane      Doe        JaneDoe@gmail.com    55
2   John      Doe        JohnDoe@gmail.com    63
3  Chris  Schafer                     None    36
5   None      NaN      Anonymous@email.com  None

In [11]:
#Casting data types
#To check data type use dtypes method

df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [14]:
#Following method is used to type cast
# Note: NaN values are trated as float values as default so  
# we should take note of this thing while casting

df['age'] = df['age'].astype(float)
df['age'].mean()

46.75